In [1]:
import pandas as pd

In [2]:
registro1 = pd.Series({'Nome' : 'Alice' , 'Classe' : 'Física' , 'Nota' : 85})
registro2 = pd.Series({'Nome' : 'Jack' , 'Classe' : 'Química' , 'Nota' : 82})
registro3 = pd.Series({'Nome' : 'Helen' , 'Classe' : 'Biologia' , 'Nota' : 90})

In [4]:
type(registro1)

pandas.core.series.Series

In [7]:
df0 = pd.DataFrame([registro1,registro2,registro3] )

In [8]:
df0.head()

    Nome    Classe  Nota
0  Alice    Física    85
1   Jack   Química    82
2  Helen  Biologia    90

In [12]:
df = pd.DataFrame([registro1,registro2,registro3] , index=['escola1' , 'escola2' , 'escola1'] )

In [13]:
df.head()

          Nome    Classe  Nota
escola1  Alice    Física    85
escola2   Jack   Química    82
escola1  Helen  Biologia    90